import N0Simple.Local.CertificateData.Affine

set_option maxHeartbeats 0
set_option maxRecDepth 100000

namespace N0Simple.Local.CertificateData

open N0Simple.Local.RationalInterval
open N0Simple.Local.AffineCertificate
open N0Simple.Local.PhaseEnvelope

def projectedPart018 : List ProjectedLine := [
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-31387751577 : ℚ) / 500000000000), ((30766343427 : ℚ) / 250000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 7, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-58878406829 : ℚ) / 1000000000000), ((2314829531 : ℚ) / 20000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 8, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-54981310503 : ℚ) / 1000000000000), ((27093215177 : ℚ) / 250000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 9, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-51084214177 : ℚ) / 1000000000000), ((100960938839 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 10, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-11796779463 : ℚ) / 250000000000), ((93506785331 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 11, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-21645010763 : ℚ) / 500000000000), ((20998829 : ℚ) / 244140625)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 12, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-98482313 : ℚ) / 2500000000), ((15694954191 : ℚ) / 200000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 13, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-283966631 : ℚ) / 8000000000), ((35448934419 : ℚ) / 500000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 14, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-31598732549 : ℚ) / 1000000000000), ((2531228091 : ℚ) / 40000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 15, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-216419033 : ℚ) / 7812500000), ((13905827917 : ℚ) / 250000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 16, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-11902269949 : ℚ) / 500000000000), ((1917023119 : ℚ) / 40000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 17, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-4976860893 : ℚ) / 250000000000), ((20093611063 : ℚ) / 500000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 18, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-16010347247 : ℚ) / 1000000000000), ((32407798661 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 19, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-12514361039 : ℚ) / 1000000000000), ((25393621459 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 20, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-12113250921 : ℚ) / 1000000000000), ((245866831 : ℚ) / 10000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 21, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-1643230919 : ℚ) / 200000000000), ((2090381479 : ℚ) / 125000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 22, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-431905827 : ℚ) / 100000000000), ((2203963093 : ℚ) / 250000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 23, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-215226629 : ℚ) / 200000000000), ((2201809393 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 24, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((-52745243 : ℚ) / 125000000000), ((21594011 : ℚ) / 25000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 25, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((0 : ℚ) / 1), ((-20001 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 26, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((1737567191 : ℚ) / 500000000000), ((-1426976409 : ℚ) / 200000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 27, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((7372230707 : ℚ) / 1000000000000), ((-15182158157 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 28, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((11269327033 : ℚ) / 1000000000000), ((-465614289 : ℚ) / 20000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 29, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((15166423359 : ℚ) / 1000000000000), ((-31433981317 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 30, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((3 : ℚ) / 2)) (((5 : ℚ) / 2))
    line := ⟨((4765879921 : ℚ) / 250000000000), ((-39646547727 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨2, ⟨[⟨.atom 31, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
]

theorem projectedPart018_check : projectedPart018.all (ProjectedLine.check phases) = true := by with_unfolding_all rfl

end N0Simple.Local.CertificateData
