import N0Simple.Local.CertificateData.Affine

set_option maxHeartbeats 0
set_option maxRecDepth 100000

namespace N0Simple.Local.CertificateData

open N0Simple.Local.RationalInterval
open N0Simple.Local.AffineCertificate
open N0Simple.Local.PhaseEnvelope

def projectedPart036 : List ProjectedLine := [
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-9661655211 : ℚ) / 1000000000000), ((4753960201 : ℚ) / 125000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 6, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-4447539109 : ℚ) / 500000000000), ((35061759399 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 7, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-4064250613 : ℚ) / 500000000000), ((6416560107 : ℚ) / 200000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 8, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-3680962117 : ℚ) / 500000000000), ((1454759759 : ℚ) / 50000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 9, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-6595347241 : ℚ) / 1000000000000), ((407800693 : ℚ) / 15625000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 10, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-5828770249 : ℚ) / 1000000000000), ((11547590559 : ℚ) / 500000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 11, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-5062193257 : ℚ) / 1000000000000), ((10041592217 : ℚ) / 500000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 12, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-536952033 : ℚ) / 125000000000), ((17063388479 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 13, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-441129909 : ℚ) / 125000000000), ((14035888991 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 14, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-2762462279 : ℚ) / 1000000000000), ((11000747453 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 15, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-1995885287 : ℚ) / 1000000000000), ((7957993781 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 16, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-245861659 : ℚ) / 200000000000), ((490762767 : ℚ) / 100000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 17, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-1205555399 : ℚ) / 1000000000000), ((962597643 : ℚ) / 200000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 18, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-1153950583 : ℚ) / 1000000000000), ((230367607 : ℚ) / 50000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 19, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((-231365651 : ℚ) / 500000000000), ((1849618889 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 20, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((0 : ℚ) / 1), ((-20001 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 21, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((30384569 : ℚ) / 100000000000), ((-1216093509 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 22, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((535211341 : ℚ) / 500000000000), ((-4289603157 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 23, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((73479987 : ℚ) / 40000000000), ((-7371039637 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 24, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((2603576667 : ℚ) / 1000000000000), ((-2092114691 : ℚ) / 200000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 25, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((3370153659 : ℚ) / 1000000000000), ((-13558423349 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 26, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((1034182663 : ℚ) / 250000000000), ((-4166216719 : ℚ) / 250000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 27, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((1225826911 : ℚ) / 250000000000), ((-9890128031 : ℚ) / 500000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 28, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((1417471159 : ℚ) / 250000000000), ((-22905041247 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 29, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((7 : ℚ) / 2)) (((9 : ℚ) / 2))
    line := ⟨((6436461629 : ℚ) / 1000000000000), ((-26039809019 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨4, ⟨[⟨.atom 30, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
]

theorem projectedPart036_check : projectedPart036.all (ProjectedLine.check phases) = true := by with_unfolding_all rfl

end N0Simple.Local.CertificateData
