import N0Simple.Local.CertificateData.Affine

set_option maxHeartbeats 0
set_option maxRecDepth 100000

namespace N0Simple.Local.CertificateData

open N0Simple.Local.RationalInterval
open N0Simple.Local.AffineCertificate
open N0Simple.Local.PhaseEnvelope

def projectedPart045 : List ProjectedLine := [
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-5506621103 : ℚ) / 1000000000000), ((27263783539 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 8, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-5009384181 : ℚ) / 1000000000000), ((24827864711 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 9, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-4512147259 : ℚ) / 1000000000000), ((11193254399 : ℚ) / 500000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 10, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-4014910337 : ℚ) / 1000000000000), ((311560451 : ℚ) / 15625000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 11, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-703534683 : ℚ) / 200000000000), ((17488062619 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 12, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-755109123 : ℚ) / 250000000000), ((7515589263 : ℚ) / 500000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 13, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-252319957 : ℚ) / 100000000000), ((12569279959 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 14, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-253245331 : ℚ) / 125000000000), ((10102407941 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 15, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-764362863 : ℚ) / 500000000000), ((953822863 : ℚ) / 125000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 16, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-1153950583 : ℚ) / 1000000000000), ((180133061 : ℚ) / 31250000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 17, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-257872201 : ℚ) / 250000000000), ((644225701 : ℚ) / 125000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 18, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-172440179 : ℚ) / 200000000000), ((1077359017 : ℚ) / 250000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 19, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-534251881 : ℚ) / 1000000000000), ((66801433 : ℚ) / 25000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 20, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((-37014959 : ℚ) / 1000000000000), ((23162417 : ℚ) / 125000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 21, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((0 : ℚ) / 1), ((-20001 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 22, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((460221963 : ℚ) / 1000000000000), ((-2306528303 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 23, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((191491777 : ℚ) / 200000000000), ((-4803508909 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 24, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((1454695807 : ℚ) / 1000000000000), ((-730575237 : ℚ) / 100000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 25, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((195193273 : ℚ) / 100000000000), ((-78507199 : ℚ) / 8000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 26, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((612292413 : ℚ) / 250000000000), ((-12326630763 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 27, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((1473203287 : ℚ) / 500000000000), ((-3711418173 : ℚ) / 250000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 28, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((430455437 : ℚ) / 125000000000), ((-8685408531 : ℚ) / 500000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 29, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((1970440209 : ℚ) / 500000000000), ((-1990244361 : ℚ) / 100000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 30, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
  { interval := ofBounds (((9 : ℚ) / 2)) (((11 : ℚ) / 2))
    line := ⟨((4438117341 : ℚ) / 1000000000000), ((-22483228107 : ℚ) / 1000000000000)⟩
    regions := [
      ⟨5, ⟨[⟨.atom 31, ((1 : ℚ) / 1)⟩]⟩⟩,
    ] },
]

theorem projectedPart045_check : projectedPart045.all (ProjectedLine.check phases) = true := by with_unfolding_all rfl

end N0Simple.Local.CertificateData
